public class Lab5 {
    public static void main(String[] args) {
    Text text = new Text("мама. блаблалб, арозаупаланалапуазора ква!");
    System.out.println(text);
    System.out.println(text.findLongestPalindrome());
   /* Text text2 = new Text("Страшні слова, коли вони мовчать, коли вони зненацька причаїлись, коли не знаєш, з чого їх почать, бо всі слова були уже чиїмись. Хтось ними плакав, мучивсь, болів, із них почав і ними ж і завершив. Людей мільярди і мільярди слів, а ти їх маєш вимовити вперше! Все повторялось: і краса, й потворність. Усе було: асфальти й спориші. Поезія – це завжди неповторність, якийсь безсмертний дотик до душі.");
    System.out.println(text2); */
    }
}
